In [1]:
import pandas as pd

In [2]:
# Assigning the movie gross table to variable
df_movie_gross = pd.read_csv('dataframe_id_bom_movie_gross_gz.csv')

In [3]:
print(df_movie_gross.head()) #checking the layout and stats
print(df_movie_gross.info)
print(df_movie_gross.shape)

                                         title studio  domestic_gross  \
0                                  Toy Story 3     BV     415000000.0
1                   Alice in Wonderland (2010)     BV     334200000.0
2  Harry Potter and the Deathly Hallows Part 1     WB     296000000.0
3                                    Inception     WB     292600000.0
4                          Shrek Forever After   P/DW     238700000.0

  foreign_gross  year
0     652000000  2010
1     691300000  2010
2     664300000  2010
3     535700000  2010
4     513900000  2010
<bound method DataFrame.info of                                             title      studio  domestic_gross  \
0                                     Toy Story 3          BV     415000000.0
1                      Alice in Wonderland (2010)          BV     334200000.0
2     Harry Potter and the Deathly Hallows Part 1          WB     296000000.0
3                                       Inception          WB     292600000.0
4                             Shrek Forever After        P/DW     238700000.0
...                                           ...         ...             ...
3382                                    The Quake       Magn.          6200.0
3383                  Edward II (2018 re-release)          FM          4800.0
3384                                     El Pacto        Sony          2500.0
3385                                     The Swan  Synergetic          2400.0
3386                            An Actor Prepares       Grav.          1700.0

     foreign_gross  year
0        652000000  2010
1        691300000  2010
2        664300000  2010
3        535700000  2010
4        513900000  2010
...            ...   ...
3382           NaN  2018
3383           NaN  2018
3384           NaN  2018
3385           NaN  2018
3386           NaN  2018

[3387 rows x 5 columns]>
(3387, 5)

In [4]:
# dropping 'studio' column due to irrelevance
df_movie_gross.drop(axis=1, columns='studio', inplace=True)

In [5]:
#finding NaNs
print(df_movie_gross.isna())
print(df_movie_gross.isna().sum())

      title  domestic_gross  foreign_gross   year
0     False           False          False  False
1     False           False          False  False
2     False           False          False  False
3     False           False          False  False
4     False           False          False  False
...     ...             ...            ...    ...
3382  False           False           True  False
3383  False           False           True  False
3384  False           False           True  False
3385  False           False           True  False
3386  False           False           True  False

[3387 rows x 4 columns]
title                0
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [6]:

# missing 5 values for sutdio [dropping column anyway] 
#domestic_gross is missing 28 values might just drop those rows
#foreign_gross missing 1350 values; calculating the percentage of data missing
(df_movie_gross['foreign_gross'].isna()
                 .sum()/len(df_movie_gross['foreign_gross'])) * 100

39.85828166519043

In [7]:
# 39.85% of our foreign gross values is missing, replacing with median values
# importing budget csv to see if I can fill in missing data by merging
df_budget = pd.read_csv('dataframe_id_tn_movie_budgets_gz.csv')
#checking head, info, and shape
print(df_budget.head())
print(df_budget.info())
df_budget.shape

   id  release_date                                        movie  \
0   1  Dec 18, 2009                                       Avatar
1   2  May 20, 2011  Pirates of the Caribbean: On Stranger Tides
2   3   Jun 7, 2019                                 Dark Phoenix
3   4   May 1, 2015                      Avengers: Age of Ultron
4   5  Dec 15, 2017            Star Wars Ep. VIII: The Last Jedi

  production_budget domestic_gross worldwide_gross
0      $425,000,000   $760,507,625  $2,776,345,279
1      $410,600,000   $241,063,875  $1,045,663,875
2      $350,000,000    $42,762,350    $149,762,350
3      $330,600,000   $459,005,868  $1,403,013,963
4      $317,000,000   $620,181,382  $1,316,721,747
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB
None

(5782, 6)

In [8]:
# dropping irrelevant columns
df_budget.drop(axis=1, columns=['id'], inplace=True)
df_budget.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 5 columns):
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: object(5)
memory usage: 226.0+ KB

In [9]:
#checking for missing values
df_budget.isna().sum()

release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [10]:
# no missing values, all relevant columns need to be converted into integers

# Ayesha's Data Cleaning for title_akas

In [12]:
df_title_akas = pd.read_csv('dataframe_id_imdb_title_akas_gz.csv')
df = df_title_akas

In [13]:
print(df_title_akas.head())
print(df_title_akas.info())
print(df_title_akas.shape)

    title_id  ordering                                    title region  \
0  tt0369610        10                            Джурасик свят     BG
1  tt0369610        11                        Jurashikku warudo     JP
2  tt0369610        12  Jurassic World: O Mundo dos Dinossauros     BR
3  tt0369610        13                  O Mundo dos Dinossauros     BR
4  tt0369610        14                           Jurassic World     FR

  language        types   attributes  is_original_title
0       bg          NaN          NaN                0.0
1      NaN  imdbDisplay          NaN                0.0
2      NaN  imdbDisplay          NaN                0.0
3      NaN          NaN  short title                0.0
4      NaN  imdbDisplay          NaN                0.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
title_id             331703 non-null object
ordering             331703 non-null int64
title                331703 non-null object
region               278410 non-null object
language             41715 non-null object
types                168447 non-null object
attributes           14925 non-null object
is_original_title    331678 non-null float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB
None
(331703, 8)

In [14]:
# Grouping data in catagories
df.groupby('region').median()

        ordering  is_original_title
region
AD           1.0                0.0
AE           1.0                0.0
AF           1.0                0.0
AG           1.0                0.0
AI           1.0                0.0
...          ...                ...
XYU          4.0                0.0
YE           2.0                0.0
ZA           1.0                0.0
ZM           2.0                0.0
ZW           1.0                0.0

[213 rows x 2 columns]

In [15]:
df.groupby('title').median()

                       ordering  is_original_title
title
!Women Art Revolution       2.5                0.0
# Pire soirée              22.0                0.0
#1 Serial Killer            2.5                0.5
#211                        3.0                0.0
#5                          1.5                0.0
...                         ...                ...
междугородный               3.0                0.0
неЧЕСТНА ИГРА              21.0                0.0
ороолон                     3.0                0.0
хуизмистерпутин             3.5                0.0
я                           3.0                0.0

[252781 rows x 2 columns]

In [16]:
df.groupby('language').mean()

           ordering  is_original_title
language
af         2.400000                0.0
ar         5.500000                0.0
az        19.000000                0.0
bg         9.748961                0.0
bn         2.393443                0.0
...             ...                ...
xh         2.000000                0.0
yi         3.500000                0.0
yue        6.489510                0.0
zh         1.500000                0.0
zu         7.666667                0.0

[76 rows x 2 columns]

In [17]:
# dropping attribute column
df = df.drop('attributes', axis = 1)
df.isna().sum()

title_id                  0
ordering                  0
title                     0
region                53293
language             289988
types                163256
is_original_title        25
dtype: int64

# Ayesha's Data Cleaning for movies

In [18]:
df_movies = pd.read_csv('dataframe_id_tmdb_movies_gz.csv')

In [19]:
print(df_movies.head())
print(df_movies.info())
print(df_movies.shape)

   Unnamed: 0            genre_ids     id original_language  \
0           0      [12, 14, 10751]  12444                en
1           1  [14, 12, 16, 10751]  10191                en
2           2        [12, 28, 878]  10138                en
3           3      [16, 35, 10751]    862                en
4           4        [28, 878, 12]  27205                en

                                 original_title  popularity release_date  \
0  Harry Potter and the Deathly Hallows: Part 1      33.533   2010-11-19
1                      How to Train Your Dragon      28.734   2010-03-26
2                                    Iron Man 2      28.515   2010-05-07
3                                     Toy Story      28.005   1995-11-22
4                                     Inception      27.920   2010-07-16

                                          title  vote_average  vote_count
0  Harry Potter and the Deathly Hallows: Part 1           7.7       10788
1                      How to Train Your Dragon           7.7        7610
2                                    Iron Man 2           6.8       12368
3                                     Toy Story           7.9       10174
4                                     Inception           8.3       22186
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
Unnamed: 0           26517 non-null int64
genre_ids            26517 non-null object
id                   26517 non-null int64
original_language    26517 non-null object
original_title       26517 non-null object
popularity           26517 non-null float64
release_date         26517 non-null object
title                26517 non-null object
vote_average         26517 non-null float64
vote_count           26517 non-null int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB
None
(26517, 10)

In [20]:
# not letting me groupby: genre_ids, original_title, popularity, release_date, 
df.groupby('title').median()

                       ordering  is_original_title
title
!Women Art Revolution       2.5                0.0
# Pire soirée              22.0                0.0
#1 Serial Killer            2.5                0.5
#211                        3.0                0.0
#5                          1.5                0.0
...                         ...                ...
междугородный               3.0                0.0
неЧЕСТНА ИГРА              21.0                0.0
ороолон                     3.0                0.0
хуизмистерпутин             3.5                0.0
я                           3.0                0.0

[252781 rows x 2 columns]


# Ayesha's Data Cleaning title_basics

In [21]:

df_title_basics = pd.read_csv('dataframe_id_imdb_title_basics_gz.csv')

In [22]:

print(df_title_basics.head())
print(df_title_basics.info())
print(df_title_basics.shape)

      tconst                    primary_title              original_title  \
0  tt0063540                        Sunghursh                   Sunghursh
1  tt0066787  One Day Before the Rainy Season             Ashad Ka Ek Din
2  tt0069049       The Other Side of the Wind  The Other Side of the Wind
3  tt0069204                  Sabse Bada Sukh             Sabse Bada Sukh
4  tt0100275         The Wandering Soap Opera       La Telenovela Errante

   start_year  runtime_minutes                genres
0        2013            175.0    Action,Crime,Drama
1        2019            114.0       Biography,Drama
2        2018            122.0                 Drama
3        2018              NaN          Comedy,Drama
4        2017             80.0  Comedy,Drama,Fantasy
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
tconst             146144 non-null object
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB
None
(146144, 6)

In [23]:
df.groupby('original_title').median()

KeyError: 'original_title'

In [24]:
#genres
df_median = df.groupby('title').median()
df_median

                       ordering  is_original_title
title
!Women Art Revolution       2.5                0.0
# Pire soirée              22.0                0.0
#1 Serial Killer            2.5                0.5
#211                        3.0                0.0
#5                          1.5                0.0
...                         ...                ...
междугородный               3.0                0.0
неЧЕСТНА ИГРА              21.0                0.0
ороолон                     3.0                0.0
хуизмистерпутин             3.5                0.0
я                           3.0                0.0

[252781 rows x 2 columns]

# Alex's Cleaning

In [1]:
import pandas as pd

In [2]:
pd.read_csv('dataframe_id_bom_movie_gross_gz.csv')

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [3]:
#importing dataframe (AT dataset 1)
title_basics = pd.read_csv("dataframe_id_imdb_title_basics_gz.csv")
title_basics.head()
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
tconst             146144 non-null object
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [6]:
#checking for missing values
title_basics.isna().sum()

tconst                0
primary_title         0
original_title       21
start_year            0
runtime_minutes       0
genres             5408
dtype: int64

In [7]:
#replacing missing runtime_minutes values with mean of existing runtime minutes
title_basics["runtime_minutes"] = title_basics['runtime_minutes'].fillna(title_basics['runtime_minutes'].mean())

In [8]:
title_basics.isna().sum()

tconst                0
primary_title         0
original_title       21
start_year            0
runtime_minutes       0
genres             5408
dtype: int64

In [9]:

#checking to see if any start year is suspicious
title_basics['start_year'].unique()

array([2013, 2019, 2018, 2017, 2012, 2010, 2011, 2015, 2021, 2016, 2014,
       2020, 2022, 2023, 2024, 2026, 2025, 2115, 2027], dtype=int64)

In [10]:
title_basics["original_title"].unique()

array(['Sunghursh', 'Ashad Ka Ek Din', 'The Other Side of the Wind', ...,
       'Dankyavar Danka', '6 Gunn', 'Chico Albuquerque - Revelações'],
      dtype=object)

In [11]:
title_basics["primary_title"].unique()

array(['Sunghursh', 'One Day Before the Rainy Season',
       'The Other Side of the Wind', ..., 'Dankyavar Danka', '6 Gunn',
       'Chico Albuquerque - Revelações'], dtype=object)

In [12]:
title_basics["tconst"].unique()

array(['tt0063540', 'tt0066787', 'tt0069049', ..., 'tt9916706',
       'tt9916730', 'tt9916754'], dtype=object)

In [13]:
#checking for duplicates
duplicates = title_basics[title_basics.duplicated(subset='tconst')]
print(len(duplicates))
duplicates.tail()

0

Empty DataFrame
Columns: [tconst, primary_title, original_title, start_year, runtime_minutes, genres]
Index: []

In [14]:
title_basics.isna().sum()

tconst                0
primary_title         0
original_title       21
start_year            0
runtime_minutes       0
genres             5408
dtype: int64

In [15]:
#replacing missing values for genres with string "missing"
title_basics['genres'] = title_basics['genres'].fillna(value="missing")

In [16]:
title_basics.isna().sum()

tconst              0
primary_title       0
original_title     21
start_year          0
runtime_minutes     0
genres              0
dtype: int64

In [17]:

title_basics.start_year.value_counts(normalize=True)

2017    0.119772
2016    0.118185
2018    0.115290
2015    0.111144
2014    0.106669
2013    0.100647
2012    0.094338
2011    0.088269
2010    0.081078
2019    0.057334
2020    0.006411
2021    0.000568
2022    0.000219
2023    0.000034
2024    0.000014
2027    0.000007
2026    0.000007
2025    0.000007
2115    0.000007
Name: start_year, dtype: float64

In [18]:

#removing all rows associated with starting year greater than 2020
title_basics = title_basics[title_basics.start_year < 2020]
title_basics["start_year"].max()
title_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.000000,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.000000,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.000000,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,86.187247,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.000000,"Comedy,Drama,Fantasy"

In [19]:
#importing dataframe (AT Dataset 2)
title_crew = pd.read_csv("dataframe_id_imdb_title_crew_gz.csv")
title_crew.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [20]:
title_crew.isna().sum()

tconst           0
directors     5727
writers      35883
dtype: int64

In [21]:
duplicates2 = title_crew[title_crew.duplicated(subset='tconst')]
print(len(duplicates2))
duplicates2.tail()

0

Empty DataFrame
Columns: [tconst, directors, writers]
Index: []

In [22]:
title_crew['tconst'].unique()

array(['tt0285252', 'tt0438973', 'tt0462036', ..., 'tt9001494',
       'tt9004986', 'tt9010172'], dtype=object)

In [23]:
title_crew['directors'].unique()

array(['nm0899854', nan, 'nm1940585', ..., 'nm10122357', 'nm6711477',
       'nm10123242,nm10123248'], dtype=object)

In [24]:
title_crew['writers'].unique()

array(['nm0899854', 'nm0175726,nm1802864', 'nm1940585', ..., 'nm6711477',
       'nm4993825', 'nm8352242'], dtype=object)

In [25]:
title_crew.directors.value_counts(normalize=True)

nm3266654                        0.000442
nm2682776                        0.000342
nm5592581                        0.000342
nm3583561                        0.000328
nm0183659                        0.000313
                                   ...
nm0017285                        0.000007
nm3298957                        0.000007
nm7505009                        0.000007
nm2050149                        0.000007
nm4583705,nm0435296,nm4583671    0.000007
Name: directors, Length: 98525, dtype: float64

In [26]:
title_crew.writers.value_counts(normalize=True)

nm0000636                                  0.000726
nm2682776                                  0.000435
nm3266654                                  0.000417
nm3583561                                  0.000363
nm0772905                                  0.000308
                                             ...
nm2404627,nm4138262,nm3072625              0.000009
nm8491526                                  0.000009
nm3123336,nm9762745                        0.000009
nm1862206,nm0717449,nm1228961,nm0224007    0.000009
nm2149983                                  0.000009
Name: writers, Length: 91920, dtype: float64

In [27]:
title_crew.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
tconst       146144 non-null object
directors    140417 non-null object
writers      110261 non-null object
dtypes: object(3)
memory usage: 3.3+ MB

In [28]:
title_crew.describe

<bound method NDFrame.describe of            tconst                      directors              writers
0       tt0285252                      nm0899854            nm0899854
1       tt0438973                            NaN  nm0175726,nm1802864
2       tt0462036                      nm1940585            nm1940585
3       tt0835418                      nm0151540  nm0310087,nm0841532
4       tt0878654  nm0089502,nm2291498,nm2292011            nm0284943
...           ...                            ...                  ...
146139  tt8999974                     nm10122357           nm10122357
146140  tt9001390                      nm6711477            nm6711477
146141  tt9001494          nm10123242,nm10123248                  NaN
146142  tt9004986                      nm4993825            nm4993825
146143  tt9010172                            NaN            nm8352242

[146144 rows x 3 columns]>

In [29]:
#replacing missing values for directors with string "missing"
title_crew['directors'] = title_crew['directors'].fillna(value="missing")

In [30]:

#replacing missing values for writers with string "missing"
title_crew['writers'] = title_crew['writers'].fillna(value="missing")

In [31]:
title_crew.isna().sum()

tconst       0
directors    0
writers      0
dtype: int64

In [32]:
#checking to see if any directors appear disproportionally indicating a placeholder value
title_crew.directors.value_counts(normalize=True)

missing                          0.039187
nm3266654                        0.000424
nm5592581                        0.000328
nm2682776                        0.000328
nm3583561                        0.000315
                                   ...
nm1395117                        0.000007
nm9707604                        0.000007
nm8327756                        0.000007
nm9445831                        0.000007
nm4583705,nm0435296,nm4583671    0.000007
Name: directors, Length: 98526, dtype: float64

In [33]:
#checking to see if any writers appear disproportionally indicating a placeholder value
title_crew.writers.value_counts(normalize=True)

missing                                    0.245532
nm0000636                                  0.000547
nm2682776                                  0.000328
nm3266654                                  0.000315
nm3583561                                  0.000274
                                             ...
nm2404627,nm4138262,nm3072625              0.000007
nm8491526                                  0.000007
nm3123336,nm9762745                        0.000007
nm1862206,nm0717449,nm1228961,nm0224007    0.000007
nm2149983                                  0.000007
Name: writers, Length: 91921, dtype: float64

In [34]:
#importing a dataframe (AT Dataframe 3)
title_principals = pd.read_csv("dataframe_id_imdb_title_principals_gz.csv")
title_principals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [35]:

title_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
tconst        1028186 non-null object
ordering      1028186 non-null int64
nconst        1028186 non-null object
category      1028186 non-null object
job           177684 non-null object
characters    393360 non-null object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [36]:
#checking for missing values
title_principals.isna().sum()

tconst             0
ordering           0
nconst             0
category           0
job           850502
characters    634826
dtype: int64

In [37]:
title_principals.tconst.value_counts(normalize=True)

tt1911535    9.725867e-06
tt4288674    9.725867e-06
tt8075192    9.725867e-06
tt4569934    9.725867e-06
tt2401179    9.725867e-06
                 ...
tt5768226    9.725867e-07
tt3117114    9.725867e-07
tt5287864    9.725867e-07
tt2811582    9.725867e-07
tt4714980    9.725867e-07
Name: tconst, Length: 143454, dtype: float64

In [38]:
title_principals.nconst.value_counts(normalize=True)

nm1930572    3.676378e-04
nm0000636    1.556139e-04
nm0000616    1.439428e-04
nm0103977    1.225459e-04
nm4394575    1.001764e-04
                 ...
nm6156695    9.725867e-07
nm1591882    9.725867e-07
nm5636494    9.725867e-07
nm3305256    9.725867e-07
nm9290923    9.725867e-07
Name: nconst, Length: 604546, dtype: float64

In [39]:
title_principals['category'].unique()

array(['actor', 'director', 'producer', 'editor', 'actress', 'composer',
       'cinematographer', 'writer', 'self', 'production_designer',
       'archive_footage', 'archive_sound'], dtype=object)

In [40]:

title_principals['job'].unique()

array([nan, 'producer', 'story', ..., 'Translation',
       'Introduction Narration Writer', 'planning'], dtype=object)

In [41]:
#checking for duplicates
title_principals[title_principals.duplicated(keep=False)].sort_values(by='tconst').head()

Empty DataFrame
Columns: [tconst, ordering, nconst, category, job, characters]
Index: []

In [42]:
title_principals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [43]:

title_principals["job"].tail()

1028181         NaN
1028182         NaN
1028183         NaN
1028184      writer
1028185    producer
Name: job, dtype: object

In [44]:
title_principals['category'].unique()

array(['actor', 'director', 'producer', 'editor', 'actress', 'composer',
       'cinematographer', 'writer', 'self', 'production_designer',
       'archive_footage', 'archive_sound'], dtype=object)

In [45]:
title_principals['ordering'].unique()

array([ 1,  2,  3, 10,  4,  5,  6,  7,  8,  9], dtype=int64)

In [46]:
#dropping a job column because about 85 percent of values are missing 
title_principals = title_principals.drop('job', axis = 1)
title_principals.isna().sum()

tconst             0
ordering           0
nconst             0
category           0
characters    634826
dtype: int64

In [47]:
title_principals.head()

      tconst  ordering     nconst  category        characters
0  tt0111414         1  nm0246005     actor       ["The Man"]
1  tt0111414         2  nm0398271  director               NaN
2  tt0111414         3  nm3739909  producer               NaN
3  tt0323808        10  nm0059247    editor               NaN
4  tt0323808         1  nm3579312   actress  ["Beth Boothby"]

In [48]:
title_principals["characters"].unique()

array(['["The Man"]', nan, '["Beth Boothby"]', ..., '["Makar Petrovich"]',
       '["Corpsman"]', '["Herself","Regan"]'], dtype=object)

In [49]:
title_principals['characters'] = title_principals['characters'].fillna(value="missing")

In [50]:
title_principals.isna().sum()

tconst        0
ordering      0
nconst        0
category      0
characters    0
dtype: int64